# PnIdModelerBrowser Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePanes..::..BuiltInDockablePanes..::..PnIdModelerBrowser Property
DockablePanes..::..BuiltInDockablePanes Class See Also
---
The P&ID modeler browser pane.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static DockablePaneId PnIdModelerBrowser { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PnIdModelerBrowser As DockablePaneId
	Get
```

Visual C++
---
```text
public:
static property DockablePaneId^ PnIdModelerBrowser {
	DockablePaneId^ get ();
}
```

# See Also
DockablePanes..::..BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace